In [1]:
import pandas as pd

In [2]:
import numpy as np

In [4]:
l=['a','b','c']
dt=[1,2,3]
d={'a':1,'b':2,'c':3}

In [6]:
pd.Series(data=dt)

0    1
1    2
2    3
dtype: int64

In [7]:
pd.Series(data=dt,index=l)

a    1
b    2
c    3
dtype: int64

In [8]:
pd.Series(data=l,index=dt)

1    a
2    b
3    c
dtype: object

In [9]:
pd.Series(d)

a    1
b    2
c    3
dtype: int64

In [10]:
sr1=pd.Series([1,2,3,4],['usa','ussr','italy','japan'])

In [11]:
sr2=pd.Series([1,2,5,4],['usa','ussr','mikk','japan'])

In [12]:
sr1

usa      1
ussr     2
italy    3
japan    4
dtype: int64

In [13]:
sr2

usa      1
ussr     2
mikk     5
japan    4
dtype: int64

In [14]:
sr1 + sr2

italy    NaN
japan    8.0
mikk     NaN
usa      2.0
ussr     4.0
dtype: float64

In [182]:
np.random.seed(101) #seed is used to retain value of random variable

In [113]:
from numpy.random import randn

In [183]:
df = pd.DataFrame(randn(4,4), ['A','B','C','D'],['W','X','Y','Z'])

In [115]:
df

          W         X         Y         Z
A  1.996652  1.996652  1.996652  1.996652
B  1.996652  1.996652  1.996652  1.996652
C  1.996652  1.996652  1.996652  1.996652
D  1.996652  1.996652  1.996652  1.996652

In [124]:
df['W']

A    1.996652
B    1.996652
C    1.996652
D    1.996652
Name: W, dtype: float64

In [131]:
df['new']=df['W'] + df['X']

In [132]:
df

          W         X         Y         Z       new
A  1.996652  1.996652  1.996652  1.996652  3.993305
B  1.996652  1.996652  1.996652  1.996652  3.993305
C  1.996652  1.996652  1.996652  1.996652  3.993305
D  1.996652  1.996652  1.996652  1.996652  3.993305

In [133]:
df.drop('new',axis=1,inplace=True)

In [134]:
df

          W         X         Y         Z
A  1.996652  1.996652  1.996652  1.996652
B  1.996652  1.996652  1.996652  1.996652
C  1.996652  1.996652  1.996652  1.996652
D  1.996652  1.996652  1.996652  1.996652

In [135]:
df.loc['A']

W    1.996652
X    1.996652
Y    1.996652
Z    1.996652
Name: A, dtype: float64

In [136]:
df.loc['A','Y']

1.9966522853695665

In [137]:
df > 0

      W     X     Y     Z
A  True  True  True  True
B  True  True  True  True
C  True  True  True  True
D  True  True  True  True

In [138]:
booldf = df >0
df[booldf]

          W         X         Y         Z
A  1.996652  1.996652  1.996652  1.996652
B  1.996652  1.996652  1.996652  1.996652
C  1.996652  1.996652  1.996652  1.996652
D  1.996652  1.996652  1.996652  1.996652

In [116]:
bl=df > 0
r = df[bl]
mycol = ['Y','X']
r[mycol]

          Y         X
A  1.996652  1.996652
B  1.996652  1.996652
C  1.996652  1.996652
D  1.996652  1.996652

In [141]:
df[df['W']>0]

          W         X         Y         Z
A  1.996652  1.996652  1.996652  1.996652
B  1.996652  1.996652  1.996652  1.996652
C  1.996652  1.996652  1.996652  1.996652
D  1.996652  1.996652  1.996652  1.996652

In [145]:
df[(df['W'] > 0) | (df['Y'] > 1)]

          W         X         Y         Z
A  1.996652  1.996652  1.996652  1.996652
B  1.996652  1.996652  1.996652  1.996652
C  1.996652  1.996652  1.996652  1.996652
D  1.996652  1.996652  1.996652  1.996652

In [151]:
df.reset_index()

  index         W         X         Y         Z
0     A  1.996652  1.996652  1.996652  1.996652
1     B  1.996652  1.996652  1.996652  1.996652
2     C  1.996652  1.996652  1.996652  1.996652
3     D  1.996652  1.996652  1.996652  1.996652

In [152]:
df

          W         X         Y         Z
A  1.996652  1.996652  1.996652  1.996652
B  1.996652  1.996652  1.996652  1.996652
C  1.996652  1.996652  1.996652  1.996652
D  1.996652  1.996652  1.996652  1.996652

In [153]:
new="CA BY NO OR".split()

In [154]:
new

['CA', 'BY', 'NO', 'OR']

In [155]:
df['states']=new

In [156]:
df

          W         X         Y         Z states
A  1.996652  1.996652  1.996652  1.996652     CA
B  1.996652  1.996652  1.996652  1.996652     BY
C  1.996652  1.996652  1.996652  1.996652     NO
D  1.996652  1.996652  1.996652  1.996652     OR

In [161]:
newr='DF HHJ FJK RYK'.split()

In [164]:
df['E']=newr

In [165]:
df

          W         X         Y         Z states    E
A  1.996652  1.996652  1.996652  1.996652     CA   DF
B  1.996652  1.996652  1.996652  1.996652     BY  HHJ
C  1.996652  1.996652  1.996652  1.996652     NO  FJK
D  1.996652  1.996652  1.996652  1.996652     OR  RYK

In [168]:
df.set_index('E',inplace=True)

In [169]:
df

            W         X         Y         Z states
E
DF   1.996652  1.996652  1.996652  1.996652     CA
HHJ  1.996652  1.996652  1.996652  1.996652     BY
FJK  1.996652  1.996652  1.996652  1.996652     NO
RYK  1.996652  1.996652  1.996652  1.996652     OR

In [173]:
outside=['G1','G1','G1','G2','G2','G2']
inside=['1','2','3','1','2','3']
h_index=list(zip(outside,inside))
hh_index=pd.MultiIndex.from_tuples(h_index)

In [174]:
hh_index

MultiIndex(levels=[['G1', 'G2'], ['1', '2', '3']],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [181]:
dff=pd.DataFrame(randn(6,3),hh_index,['A','B','C'])

In [188]:
dff

             A         B         C
G1 1 -0.568581  1.407338  0.641806
   2 -0.905100 -0.391157  1.028293
   3 -1.972605 -0.866885  0.720788
G2 1 -1.223082  1.606780 -1.115710
   2 -1.385379 -1.329660  0.041460
   3 -0.411055 -0.771329  0.110477

In [189]:
dff.loc['G1']

          A         B         C
1 -0.568581  1.407338  0.641806
2 -0.905100 -0.391157  1.028293
3 -1.972605 -0.866885  0.720788

In [186]:
dff.loc['G2'].loc['2']

A   -1.385379
B   -1.329660
C    0.041460
Name: 2, dtype: float64

In [187]:
dff.loc['G2'].loc['3'].loc['C']

0.11047741113032297

In [192]:
dff.xs('G1')    #cross-section method

          A         B         C
1 -0.568581  1.407338  0.641806
2 -0.905100 -0.391157  1.028293
3 -1.972605 -0.866885  0.720788

In [198]:
dff.index.names=['GROUPS','NUM']   #____indexing

In [199]:
dff

                   A         B         C
GROUPS NUM
G1     1   -0.568581  1.407338  0.641806
       2   -0.905100 -0.391157  1.028293
       3   -1.972605 -0.866885  0.720788
G2     1   -1.223082  1.606780 -1.115710
       2   -1.385379 -1.329660  0.041460
       3   -0.411055 -0.771329  0.110477

In [214]:
dff.xs('1' ,level='NUM',axis=0)

               A         B         C
GROUPS
G1     -0.568581  1.407338  0.641806
G2     -1.223082  1.606780 -1.115710

In [215]:
d={'A':[1,2,np.nan],'B':[1,np.nan,np.nan],'C':[1,2,3]}

In [216]:
ddf=pd.DataFrame(d)

In [226]:
ddf.index.name='S.N.'

In [227]:
ddf

        A    B  C
S.N.
0     1.0  1.0  1
1     2.0  NaN  2
2     NaN  NaN  3

In [218]:
ddf.dropna()

     A    B  C
0  1.0  1.0  1

In [228]:
ddf.dropna(axis=1)

      C
S.N.
0     1
1     2
2     3

In [233]:
ddf['A'].fillna(value=ddf['A'].mean())

S.N.
0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [234]:
ddf.dropna(thresh=2)

        A    B  C
S.N.
0     1.0  1.0  1
1     2.0  NaN  2

In [246]:
dic={'company':['google','google','msft','msft','fb','fb'],'seller':['charlie','james','john','amy','carl','milon'],'prices':[10,20,30,40,50,60]}

In [247]:
gdf=pd.DataFrame(dic)

In [248]:
gdf

  company   seller  prices
0  google  charlie      10
1  google    james      20
2    msft     john      30
3    msft      amy      40
4      fb     carl      50
5      fb    milon      60

In [249]:
rcomp=gdf.groupby('company')

In [250]:
rcomp.mean()

         prices
company
fb           55
google       15
msft         35

In [251]:
rcomp.std()

           prices
company
fb       7.071068
google   7.071068
msft     7.071068

In [253]:
rcomp.sum()

         prices
company
fb          110
google       30
msft         70

In [254]:
rcomp.sum().loc['fb']

prices    110
Name: fb, dtype: int64

In [255]:
 rcomp.count()

         seller  prices
company
fb            2       2
google        2       2
msft          2       2

In [258]:
rcomp.max()

        seller  prices
company
fb       milon      60
google   james      20
msft      john      40

In [261]:
rcomp.describe()

        prices
         count  mean       std   min   25%   50%   75%   max
company
fb         2.0  55.0  7.071068  50.0  52.5  55.0  57.5  60.0
google     2.0  15.0  7.071068  10.0  12.5  15.0  17.5  20.0
msft       2.0  35.0  7.071068  30.0  32.5  35.0  37.5  40.0

In [297]:
df1={'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3'],'C':['C0','C1','C2','C3']}

In [298]:
df2={'A':['A4','A5','A6','A7'],'B':['B4','B5','B6','B7'],'C':['C4','C5','C6','C7']}

In [299]:
df3={'A':['A8','A9','A10','A11'],'B':['B8','B9','B10','B11'],'C':['C8','C9','C10','C11']}

In [300]:
df1

{'A': ['A0', 'A1', 'A2', 'A3'],
 'B': ['B0', 'B1', 'B2', 'B3'],
 'C': ['C0', 'C1', 'C2', 'C3']}

In [301]:
df1=pd.DataFrame(df1,index=[0,1,2,3])

In [302]:
df2=pd.DataFrame(df2,index=[4,5,6,7])

In [303]:
df3=pd.DataFrame(df3,index=[8,9,10,11])

In [304]:
pd.concat([df1,df2,df3])

      A    B    C
0    A0   B0   C0
1    A1   B1   C1
2    A2   B2   C2
3    A3   B3   C3
4    A4   B4   C4
5    A5   B5   C5
6    A6   B6   C6
7    A7   B7   C7
8    A8   B8   C8
9    A9   B9   C9
10  A10  B10  C10
11  A11  B11  C11

In [305]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    A    B    C    A    B    C
0    A0   B0   C0  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN   A4   B4   C4  NaN  NaN  NaN
5   NaN  NaN  NaN   A5   B5   C5  NaN  NaN  NaN
6   NaN  NaN  NaN   A6   B6   C6  NaN  NaN  NaN
7   NaN  NaN  NaN   A7   B7   C7  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8
9   NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9
10  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10
11  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11

In [7]:
l=pd.DataFrame({'A':['A0','A1','A2'],'B':['B0','B1','B2'],'C':['C0','C1','C2']},index=['k0','k1','k2'])

In [12]:
r=pd.DataFrame({'D':['D0','D1','D2'],'E':['E0','E1','E2'],'F':['F0','F1','F2']},index=['k0','k2','k3'])

In [13]:
l.join(r)

     A   B   C    D    E    F
k0  A0  B0  C0   D0   E0   F0
k1  A1  B1  C1  NaN  NaN  NaN
k2  A2  B2  C2   D1   E1   F1

In [14]:
r.join(l)

     D   E   F    A    B    C
k0  D0  E0  F0   A0   B0   C0
k2  D1  E1  F1   A2   B2   C2
k3  D2  E2  F2  NaN  NaN  NaN

In [15]:
l.join(r,how='outer')

      A    B    C    D    E    F
k0   A0   B0   C0   D0   E0   F0
k1   A1   B1   C1  NaN  NaN  NaN
k2   A2   B2   C2   D1   E1   F1
k3  NaN  NaN  NaN   D2   E2   F2

In [17]:
r.join(l,how='outer')

      D    E    F    A    B    C
k0   D0   E0   F0   A0   B0   C0
k1  NaN  NaN  NaN   A1   B1   C1
k2   D1   E1   F1   A2   B2   C2
k3   D2   E2   F2  NaN  NaN  NaN

In [3]:
dfrm=pd.DataFrame({'cols1':[1,2,3,4],'cols2':[333,444,555,333],'cols3':['abc','def','igh','klm']})

In [4]:
dfrm

   cols1  cols2 cols3
0      1    333   abc
1      2    444   def
2      3    555   igh
3      4    333   klm

In [5]:
dfrm['cols2'].unique()

array([333, 444, 555])

In [6]:
dfrm['cols2'].nunique()

3

In [7]:
dfrm['cols2'].value_counts()

333    2
555    1
444    1
Name: cols2, dtype: int64

In [8]:
dfrm['cols2']>1

0    True
1    True
2    True
3    True
Name: cols2, dtype: bool

In [9]:
dfrm['cols1'].sum()

10

In [10]:
dfrm['cols1'].apply(lambda x:x*2)

0    2
1    4
2    6
3    8
Name: cols1, dtype: int64

In [11]:
dfrm.drop('cols1' , axis=1,inplace=True)

In [12]:
dfrm

   cols2 cols3
0    333   abc
1    444   def
2    555   igh
3    333   klm

In [13]:
dfrm.sort_values('cols2')

   cols2 cols3
0    333   abc
3    333   klm
1    444   def
2    555   igh

In [12]:
dfm=pd.read_csv('example.csv')

In [16]:
dfm.to_csv('my_output',index=False)

In [17]:
pd.read_csv('my_output')

   A   B  P  Q  R
0  8   6  5  9  1
1  1   6  3  8  2
2  4   4  3  8  3
3  3  43  2  7  4
4  7   6  7  6  5